
## Plan Result (stg)




<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * module.api_mgmt_product.azurerm_api_management_product.product


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api_mgmt_product.azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/hmi-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (9 unchanged attributes hidden)
    }

  # module.apim_apis.data.azurerm_api_management_product.apim_product will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_api_management_product" "apim_product" {
      + api_management_name   = "sds-api-mgmt-stg"
      + approval_required     = (known after apply)
      + description           = (known after apply)
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + product_id            = "hmi-product-stg"
      + published             = (known after apply)
      + resource_group_name   = "ss-stg-network-rg"
      + subscription_required = (known after apply)
      + subscriptions_limit   = (known after apply)
      + terms                 = (known after apply)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":102,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->